{
  "activation_function": "gelu_new",
  "attn_pdrop": 0.1,
  "bos_token_id": 50256,
  "builderbrain_config": {
    "alpha_cap": 0.05,
    "base_model_type": "gpt2",
    "builder_layers": 4,
    "dual_rail": true,
    "fusion_gates": true,
    "grammar_constraints": true,
    "num_programs": 8,
    "program_adapters": true,
    "safety_monitoring": true
  },
  "embd_pdrop": 0.1,
  "eos_token_id": 50256,
  "initializer_range": 0.02,
  "layer_norm_epsilon": 1e-05,
  "model_type": "gpt2",
  "n_embd": 768,
  "n_head": 12,
  "n_inner": null,
  "n_layer": 4,
  "n_positions": 1024,
  "pad_token_id": 50256,
  "reorder_and_upcast_attn": false,
  "resid_pdrop": 0.1,
  "scale_attn_by_inverse_layer_idx": false,
  "scale_attn_weights": true,
  "summary_activation": null,
  "summary_first_dropout": 0.1,
  "summary_proj_to_labels": true,
  "summary_type": "cls_index",
  "summary_use_proj": true,
  "transformers_version": "4.56.2",
  "use_cache": true,
  "vocab_size": 50257
}
